print('hello python');
print('안녕하셔유 파이썬 시작해봤어유');

# 주석은 #인가요?

# 연산자는 자바스크립트랑 똑같아요. 그거야 사칙연산이니까?
# 문자열과 스트링 선언 역시 자바스크립트랑 똑같아요.
# 결과값 확인은 디버깅으로 확인해요.

print(5 + 6); # 더하기 연산자, 11

print(400 - 245); # 빼기 연산자, 155

print(563 * 4); # 곱하기 연산자, 2252

print(2 ** 56); # 거듭제곱 연산자, 72057594037927936

print(400 / 45); # 나눗셈 연산자, 8.88888888888889

print(90 % 4); # 나머지 연산자, 2


# 몫과 나머지를 한 번에 구하기?
# 나눗셈의 몫과 나머지를 한꺼번에 구할 수 있는건가?
# "divmod()" 함수를 사용하라고 합니다.

divmod(50, 8); # 2

# 변수선언도 자바스크립트와 같은거 같아요.

apple = 5000; banana = 3500;

# 사과 값과 바나나 값 더하기

print(apple + banana);
